## Terraform Plan Result


### environments/stg/network/subnet
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.private_subnet[0].aws_route.public_internet_access[0] will be created
  + resource "aws_route" "public_internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "ap-southeast-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.private_subnet[0].aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-southeast-2"
      + route            = (known after apply)
      + tags             = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-01-rt-public"
          + "Project"     = "STP-2025"
        }
      + tags_all         = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-01-rt-public"
          + "Project"     = "STP-2025"
        }
      + vpc_id           = (known after apply)
    }

  # module.private_subnet[0].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-southeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.private_subnet[0].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-2"
      + tags                                           = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-01-public"
          + "Project"     = "STP-2025"
        }
      + tags_all                                       = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-01-public"
          + "Project"     = "STP-2025"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.private_subnet[1].aws_route.public_internet_access[0] will be created
  + resource "aws_route" "public_internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "ap-southeast-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.private_subnet[1].aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-southeast-2"
      + route            = (known after apply)
      + tags             = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-02-rt-public"
          + "Project"     = "STP-2025"
        }
      + tags_all         = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-02-rt-public"
          + "Project"     = "STP-2025"
        }
      + vpc_id           = (known after apply)
    }

  # module.private_subnet[1].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-southeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.private_subnet[1].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-2"
      + tags                                           = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-02-public"
          + "Project"     = "STP-2025"
        }
      + tags_all                                       = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-private-subnet-02-public"
          + "Project"     = "STP-2025"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnet[0].aws_route.public_internet_access[0] will be created
  + resource "aws_route" "public_internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "ap-southeast-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.public_subnet[0].aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-southeast-2"
      + route            = (known after apply)
      + tags             = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-public-subnet-01-rt-public"
          + "Project"     = "STP-2025"
        }
      + tags_all         = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-public-subnet-01-rt-public"
          + "Project"     = "STP-2025"
        }
      + vpc_id           = (known after apply)
    }

  # module.public_subnet[0].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-southeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_subnet[0].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-2"
      + tags                                           = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-public-subnet-01-public"
          + "Project"     = "STP-2025"
        }
      + tags_all                                       = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-public-subnet-01-public"
          + "Project"     = "STP-2025"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnet[1].aws_route.public_internet_access[0] will be created
  + resource "aws_route" "public_internet_access" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "ap-southeast-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.public_subnet[1].aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "ap-southeast-2"
      + route            = (known after apply)
      + tags             = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-public-subnet-02-rt-public"
          + "Project"     = "STP-2025"
        }
      + tags_all         = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-public-subnet-02-rt-public"
          + "Project"     = "STP-2025"
        }
      + vpc_id           = (known after apply)
    }

  # module.public_subnet[1].aws_route_table_association.this will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "ap-southeast-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_subnet[1].aws_subnet.this will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "ap-southeast-2"
      + tags                                           = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-public-subnet-02-public"
          + "Project"     = "STP-2025"
        }
      + tags_all                                       = {
          + "Created_by"  = "Tong Viet Hoang"
          + "Environment" = "Staging"
          + "Name"        = "stg-public-subnet-02-public"
          + "Project"     = "STP-2025"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "ap-southeast-2"
      + tags     = {
          + "Name" = "stg-main-vpc-igw"
        }
      + tags_all = {
          + "Name" = "stg-main-vpc-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "ap-southeast-2"
      + tags                                 = {
          + "Name" = "stg-main-vpc"
        }
      + tags_all                             = {
          + "Name" = "stg-main-vpc"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnet_ids = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
    ]
```
<!-- Sticky Pull Request Commentterraform-plan -->